#### 随堂练习答案

Lecture 4：分组

In [2]:
import pandas as pd
import numpy as np

In [8]:
#思考一：根据0.25分位数和0.75分位数进行分割，将体重分为high、normal和low这三组，统计每组身高的均值。
df=pd.read_csv('data/learn_pandas.csv')
q25=df.Weight.quantile(0.25)
q75=df.Weight.quantile(0.75)
q25
w_dic={0:'low',1:'normal',2:'high'}
# ((df.Weight>q25)*1+(df.Weight>q75)*1)
condition=((df.Weight>q25)*1+(df.Weight>q75)*1).replace(w_dic)
condition
df.groupby(condition)['Height'].mean()

Weight
high      174.935714
low       155.891071
normal    162.255294
Name: Height, dtype: float64

In [12]:
#思考2：在learn_pandas.csv数据集中，Transfer列元素为“N”时表示该同学不是转系生，请按照学校和年级两列分组，找出所有不含转系生的组对应的学校和年级
res=(df.Transfer=='N').groupby([df.School,df.Grade]).all()
res
res[~res].index
# df[df.Transfer=='N'].groupby([df.School,df.Grade]).all().index

MultiIndex([(             'Fudan University',    'Junior'),
            (             'Fudan University',    'Senior'),
            (            'Peking University',  'Freshman'),
            (            'Peking University',    'Junior'),
            (            'Peking University',    'Senior'),
            (            'Peking University', 'Sophomore'),
            ('Shanghai Jiao Tong University',    'Senior'),
            (          'Tsinghua University',  'Freshman'),
            (          'Tsinghua University',    'Junior'),
            (          'Tsinghua University',    'Senior'),
            (          'Tsinghua University', 'Sophomore')],
           names=['School', 'Grade'])

In [24]:
#练习1
df=pd.read_csv('data/Ex/car.csv')

In [26]:
res=df.Brand[df.groupby('Country')['Country'].transform(lambda x:x.shape[0]>2)]
res.values

array(['Eagle Summit 4', 'Ford Escort   4', 'Ford Festiva 4',
       'Honda Civic 4', 'Mazda Protege 4', 'Nissan Sentra 4',
       'Pontiac LeMans 4', 'Subaru Loyale 4', 'Subaru Justy 3',
       'Toyota Corolla 4', 'Toyota Tercel 4', 'Chevrolet Camaro V8',
       'Dodge Daytona', 'Ford Mustang V8', 'Ford Probe',
       'Honda Civic CRX Si 4', 'Honda Prelude Si 4WS 4', 'Nissan 240SX 4',
       'Plymouth Laser', 'Subaru XT 4', 'Buick Skylark 4',
       'Chevrolet Beretta 4', 'Chrysler Le Baron V6', 'Ford Tempo 4',
       'Honda Accord 4', 'Mazda 626 4', 'Mitsubishi Galant 4',
       'Mitsubishi Sigma V6', 'Nissan Stanza 4', 'Oldsmobile Calais 4',
       'Subaru Legacy 4', 'Toyota Camry 4', 'Acura Legend V6',
       'Buick Century 4', 'Chrysler Le Baron Coupe',
       'Chrysler New Yorker V6', 'Eagle Premier V6', 'Ford Taurus V6',
       'Ford Thunderbird V6', 'Hyundai Sonata 4', 'Mazda 929 V6',
       'Nissan Maxima V6', 'Oldsmobile Cutlass Ciera 4',
       'Oldsmobile Cutlass Supreme V6', 'Toyota Cressida 6',
       'Buick Le Sabre V6', 'Chevrolet Caprice V8',
       'Ford LTD Crown Victoria V8', 'Chevrolet Lumina APV V6',
       'Dodge Grand Caravan V6', 'Ford Aerostar V6', 'Mazda MPV V6',
       'Mitsubishi Wagon 4', 'Nissan Axxess 4', 'Nissan Van 4'],
      dtype=object)

In [27]:
df.groupby('Country')['Price'].agg([('价格均值','mean'),('价格变异稀疏',lambda x:x.std()/x.mean()),('汽车数量','count')])

                   价格均值    价格变异稀疏  汽车数量
Country
France     15930.000000       NaN     1
Germany    14447.500000  0.435839     2
Japan      13938.052632  0.387429    19
Japan/USA  10067.571429  0.240040     7
Korea       7857.333333  0.243435     3
Mexico      8672.000000       NaN     1
Sweden     18450.000000       NaN     1
USA        12543.269231  0.203344    26

In [31]:
s=pd.Series(np.empty(df.shape[0]))
s.iloc[:s.shape[0]//3]='a.前三分之一'
s.iloc[s.shape[0]//3:s.shape[0]//3*2]='b.中间三分之一'
s.iloc[s.shape[0]//3*2:]='c.后三分之一'
df.groupby(s.values)['Price'].mean()

a.前三分之一      9069.95
b.中间三分之一    13356.40
c.后三分之一     15420.65
Name: Price, dtype: float64

In [33]:
res=df.groupby('Type').agg({"Price":['max'],'HP':['min']})
res.columns=res.columns.map(lambda x:'_'.join(x))
res

         Price_max  HP_min
Type
Compact      18900      95
Large        17257     150
Medium       24760     110
Small         9995      63
Sporty       13945      92
Van          15395     106

In [34]:
def normalize(s):
    s_min,s_max=s.min(),s.max()
    res=(s-s_min)/(s_max-s_min)
    return res

df.groupby('Type')['HP'].transform(normalize).head()

0    1.00
1    0.54
2    0.00
3    0.58
4    0.80
Name: HP, dtype: float64